Revit 2027 API
SchedulableField Constructor
Overload List
Name | Description
SchedulableField() |  Creates a new SchedulableField.
SchedulableField(Guid) |  Creates a new SchedulableField.
SchedulableField(ScheduleFieldType) |  Creates a new SchedulableField.
SchedulableField(ScheduleFieldType, ElementId) |  Creates a new SchedulableField.
Top
See Also
Reference
SchedulableField Class
Autodesk.Revit.DB Namespace